-- 1. Ранжировать учеников по баллам всех экзаменов испльзуя функцию DENDE_RANK()


-- 2. Ранжировать учеников по баллам всех экзаменов испльзуя функцию RANK()


-- 3. Если хотим ранжировать всех учеников по классам


-- 4. Решить предыдущую задачу если мы хотим сделать сортировку,
-- разбив по предметам(subjects) и в каждом предмете расположить
-- учеников по возрастанию результатов


-- 5. Разбить учащихся на 3 группы в зависимости от набранных
-- баллов (функция NTILE)


-- 6. Разбить учащихся на две группы для каждого из предметов(subjects),
-- группы в порядке возрастания баллов


-- 7. Найти в каждом классе(class) одного лучшего по баллам ученика 
-- выыессти для них class, points,subjects, id, name


-- 8. Решить задачу предыдущую задачу но уже найти лучших 
-- не по классу , а по предмету(subjects)


-- 9. Показать результаты предыдущего и следующего
-- ученика при сортировке по баллам(функции LAG() и LEAD())


-- 10. Найти насколько при отсортированных данных следующие
-- результаты отличаются от предыдущих по баллам в процентах ,
-- использовать функцию LAG()


-- 11. Найти насколько при отсортированных данных следующие
-- результаты отличаются от предыдущих по баллам в процентах ,
-- использовать функцию LEAD()


-- 12. Определить баллы для каждого ученика и данные лучшего и самого отстающего
-- по сравнению с рассматриваемым учеником для каждого предмета(Функции FIRST_VALUE и LAST_VALUE)


-- 13.Решить предыдущую задачу без оконных функций.
-- Определить баллы для каждого ученика и данные лучшего и самого отстающего
-- по сравнению с рассматриваемым учеником для каждого предмета без
-- оконных функций традиционным методом


-- 14. Определить баллы для каждого ученика и разницу между лучшим и самым отстающим
-- по сравнению с рассматриваемым учеником для каждого класса


-- 15. Определить разницу в процентах для каждого ученика между его результатом и 
-- и лучшим результатом по его предмету


-- 16. Определить по каждому предмету сумму баллов и долю каждого ученика по отношению
-- к данной сумме по каждому предмету


-- 17. Определить по каждому классу сумму баллов и долю каждого ученика по отношению
-- к данной сумме по каждому классу


-- 18. Определить сколько учеников сдавало экзамен по каждому предмету,
-- средний балл по каждому предмету
-- отношение баллов каждого ученика к среднему баллу по каждому предмету


-- 19. БЕЗ ОКОННЫХ ФУНКЦИЙ. Определить сколько учеников сдавало экзамен по каждому предмету,
-- средний балл по каждому предмету
-- отношение баллов каждого ученика к среднему баллу по каждому предмету


-- 20. Определить доход и расход с нарастающим итогом


-- 21. Определить разницу дохода с нарастающим итогом и расхода с нарастающим итогом


-- 22. Определить разницу дохода с нарастающим итогом и расхода с нарастающим итогом
-- для каждого года


-- 23. Определить среднее значение за каждые три года дохода и расхода
